wolfSSL/wolfBoot/tools/unit-tests/unit-stm32g0-write.c
/* unit-stm32g0-write.c
 *
 * Regression test for F-11023 on the STM32G0 copy of the double-word
 * fast path: the fast path of hal_flash_write() in hal/stm32g0.c must
 * be taken only with at least eight bytes remaining, so an aligned
 * 4-7 byte tail falls to the RMW branch and reads nothing past the
 * caller's buffer. The G4/G0 files carry the same fast path and were
 * fixed in the same commit (6025f354); this harness mirrors
 * unit-stm32g4-write for the G0 copy.
 *
 * Same harness as the STM32L5/STM32U5 twins: extracted functions,
 * registers on a host file, stale destination flash, canary after
 * the source. The source buffer is 8-byte aligned so the fast-path
 * alignment test on the data pointer can pass.
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfBoot.
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include <check.h>
#include <stdint.h>
#include <string.h>
#include <sys/mman.h>

/* Host stand-in for the ARM build attribute. */
#define RAMFUNCTION

/* Host FLASH register file (offsets as in hal/stm32g0.c). */
static uint32_t g_flash_regs[0x20 / sizeof(uint32_t)];
#define FLASH_BASE ((uintptr_t)g_flash_regs)
#define FLASH_SR   (*(volatile uint32_t *)(FLASH_BASE + 0x10))
#define FLASH_CR   (*(volatile uint32_t *)(FLASH_BASE + 0x14))
#define FLASH_SR_EOP     (1 << 0)
#define FLASH_SR_PROGERR (1 << 3)
#define FLASH_SR_WRPERR  (1 << 4)
#define FLASH_SR_PGAERR  (1 << 5)
#define FLASH_SR_SIZERR  (1 << 6)
#define FLASH_SR_BSY1    (1 << 16)
#define FLASH_CR_PG      (1 << 0)

/* Destination flash: pre-filled with stale data (rewrite scenario).
 * hal_flash_write() takes the address as uint32_t (32-bit MCU), so on
 * the 64-bit host the flash must live at an address that fits in 32
 * bits: map it at a fixed low location. */
#define FLASH_MEM_SZ 256
#define FLASH_MEM_ADDR 0x10000000UL
static uint8_t *g_flash_mem;

/* Source buffer followed by a canary: a pre-fix short write reads the
 * canary and lands it in the destination flash. */
#define DATA_SZ 64
#define CANARY_SZ 32
static uint8_t g_data[DATA_SZ + CANARY_SZ] __attribute__((aligned(8)));
#define g_canary (g_data + DATA_SZ)

/* The real functions from hal/stm32g0.c (extracted by the Makefile). */
#include "stm32g0_write_extract.h"

static void setup(void)
{
    int i;

    memset(g_flash_regs, 0, sizeof(g_flash_regs));
    for (i = 0; i < FLASH_MEM_SZ; i++)
        g_flash_mem[i] = 0x12; /* stale */
    for (i = 0; i < DATA_SZ; i++)
        g_data[i] = (uint8_t)(0x30 + i);
    /* 0x70..0x8F: distinct from the data bytes (0x30..0x6F), the stale
     * flash fill (0x12) and the erased-value padding (0xFF), so a
     * canary hit means source bytes past len were really read. */
    for (i = 0; i < CANARY_SZ; i++)
        g_canary[i] = (uint8_t)(0x70 + i);
}

static void teardown(void)
{
}

static int canary_in_flash(void)
{
    int i;

    for (i = 0; i < CANARY_SZ; i++)
        if (memchr(g_flash_mem, g_canary[i], FLASH_MEM_SZ) != NULL)
            return 1;
    return 0;
}

/* A write of 60 bytes: seven full double words, then a 4-byte tail.
 * Pre-fix the tail took the fast path and programmed bytes 60..63
 * from source bytes past len. Post-fix the tail is RMW'd and nothing
 * past len is read or written. */
START_TEST(test_write_60_no_overread)
{
    int i;

    ck_assert_int_eq(hal_flash_write((uint32_t)(uintptr_t)g_flash_mem,
        g_data, 60), 0);

    ck_assert_int_eq(memcmp(g_flash_mem, g_data, 60), 0);
    for (i = 60; i < FLASH_MEM_SZ; i++)
        ck_assert_uint_eq(g_flash_mem[i], 0x12);
    ck_assert_int_eq(canary_in_flash(), 0);
}
END_TEST

/* A write of 58 bytes: the final unit is partial (bytes 58,59 are
 * outside the request); they are read back from flash and rewritten
 * unchanged, and nothing past len is read. */
START_TEST(test_write_58_partial_word_padded)
{
    int i;

    ck_assert_int_eq(hal_flash_write((uint32_t)(uintptr_t)g_flash_mem,
        g_data, 58), 0);

    ck_assert_int_eq(memcmp(g_flash_mem, g_data, 58), 0);
    /* word 14 (bytes 56..59): 58,59 keep their flash content */
    ck_assert_uint_eq(g_flash_mem[58], 0x12);
    ck_assert_uint_eq(g_flash_mem[59], 0x12);
    for (i = 60; i < FLASH_MEM_SZ; i++)
        ck_assert_uint_eq(g_flash_mem[i], 0x12);
    ck_assert_int_eq(canary_in_flash(), 0);
}
END_TEST

/* A write of 3 bytes: the whole 8-byte unit is programmed, but only
 * bytes 0..2 take the requested value; the rest is rewritten with
 * what flash already held. */
START_TEST(test_write_3_single_word_padded)
{
    int i;

    ck_assert_int_eq(hal_flash_write((uint32_t)(uintptr_t)g_flash_mem,
        g_data, 3), 0);

    ck_assert_int_eq(memcmp(g_flash_mem, g_data, 3), 0);
    /* byte 3 and the whole second word are rewritten unchanged */
    ck_assert_uint_eq(g_flash_mem[3], 0x12);
    for (i = 4; i < FLASH_MEM_SZ; i++)
        ck_assert_uint_eq(g_flash_mem[i], 0x12);
    ck_assert_int_eq(canary_in_flash(), 0);
}
END_TEST

/* A write of 64 bytes, a multiple of 8: the fast path is taken for
 * every unit and behaves exactly as before the fix. */
START_TEST(test_write_64_full_units)
{
    int i;

    ck_assert_int_eq(hal_flash_write((uint32_t)(uintptr_t)g_flash_mem,
        g_data, 64), 0);

    ck_assert_int_eq(memcmp(g_flash_mem, g_data, 64), 0);
    for (i = 64; i < FLASH_MEM_SZ; i++)
        ck_assert_uint_eq(g_flash_mem[i], 0x12);
}
END_TEST

/* A write starting at an address with mod-8 residue 1: the byte-wise
 * prefix leaves i = 7, where the fast path fires with i % 4 != 0.
 * Pre-fix the double word was programmed 3 bytes below the intended
 * address and the last 3 bytes of the unit were never programmed. */
START_TEST(test_write_unaligned_start)
{
    int i;

    ck_assert_int_eq(hal_flash_write((uint32_t)(uintptr_t)(g_flash_mem + 1),
        g_data + 1, 16), 0);

    ck_assert_int_eq(memcmp(g_flash_mem + 1, g_data + 1, 16), 0);
    ck_assert_uint_eq(g_flash_mem[0], 0x12);
    for (i = 17; i < FLASH_MEM_SZ; i++)
        ck_assert_uint_eq(g_flash_mem[i], 0x12);
    ck_assert_int_eq(canary_in_flash(), 0);
}
END_TEST

int main(void)
{
    int fails;
    SRunner *sr;
    Suite *s = suite_create("stm32g0_write");
    TCase *tc = tcase_create("stm32g0_write");

    g_flash_mem = (uint8_t *)mmap((void *)FLASH_MEM_ADDR, FLASH_MEM_SZ,
                                  PROT_READ | PROT_WRITE,
                                  MAP_PRIVATE | MAP_ANONYMOUS | MAP_FIXED,
                                  -1, 0);
    if (g_flash_mem == MAP_FAILED)
        return 77;

    tcase_add_checked_fixture(tc, setup, teardown);
    tcase_add_test(tc, test_write_60_no_overread);
    tcase_add_test(tc, test_write_58_partial_word_padded);
    tcase_add_test(tc, test_write_3_single_word_padded);
    tcase_add_test(tc, test_write_64_full_units);
    tcase_add_test(tc, test_write_unaligned_start);
    suite_add_tcase(s, tc);

    sr = srunner_create(s);
    srunner_run_all(sr, CK_NORMAL);
    fails = srunner_ntests_failed(sr);
    srunner_free(sr);
    munmap(g_flash_mem, FLASH_MEM_SZ);

    return fails;
}
